$(document).ready(function() {
  var schoolName = ['莱州市第一中学', '侯马一中', '勉县第一中学', '虹桥中学', '浙江省黄岩中学', '海盐高级中学', '福建三明一中', '开化中学', '衢州二中', '浙江省苍南中学', '嘉善高级中学', '浙江省严州中学', '丽水中学', '同煤一中', '春晖中学', '鄞州高中', '新昌中学', '德宏州民族一中', '绵阳中学', '东阳中学', '宜春中学', '宁波二中', '江西师大附中', '河南商丘一高', '河北定州中学', '东阳中学', '柴桥中学', '杭州第四中学', '萧山中学', '浒山中学', '萧山二中', '石家庄精英中学', '缙云中学', '乐清中学', '平顶山一中', '安吉振民高级中学', '浦江中学', '北仑中学', '牌头中学', '海宁市高级中学', '忻州市第一中学 ', '华茂外国语学校高中', '肥东第一中学', '柯桥中学', '台州市第一中学', '灵丘一中', '天台育青中学', '湖州市第二中学', '瓯海区第一中学', '德清一中', '崧厦中学', '大同一中', '松阳县第一中学', '台州中学', '牌头中学', '凤鸣高级中学', '罗浮中学', '余杭第二高级中学', '襄阳市第五中学', '桐乡一中', '嘉兴市第五高级中学', '秀州中学', '草塔中学', '路桥中学', '吴兴高级中学', '兰溪市第三中学', '萧山第五高级中学', '包钢一中', '於潜中学', '越崎中学', '澄潭中学', '海宁市第一中学', '达州市第一中学', '马寅初中学', '会泽县茚旺高级中学', '龙泉市第一中学', '商城高级中学', '赤峰市红旗中学', '经纬中学', '敦煌中学', '南马高中', '南康中学', '仁寿一中', '丹东市第二中学', '东阳二中', '东阳市中天高中', '永康二中', '永康一中']
    ;

  for(var i=1;i<89;i++){
    $('#school-list').append("<tr><td>" + i + "</td><td><a href='/vote/muxiao/introduce.html#" + i + "'>" + schoolName[i-1] + "&nbsp;<span class='glyphicon glyphicon-new-window'></span></a></td><td><input class='checkbox' type='checkbox' value='" + i + "'/></td></tr>");
  }

});

